[LOAD]	3
STORE	x

LOAD 	y
XOR	 	x
JNZ	    LINHA 10

STORE 	z

LOAD 	y
[IMUL] 	5
ADD 	x
[ADD]	-2 

STORE 	z

(*
----------------------------------------------------------------------------------------------------------
COMANDO		CÓDIGO												DESCRIÇÃO							   	 |
----------------------------------------------------------------------------------------------------------
[ADD]		 000		Recebe um valor constante e adiciona ao acumulador 								 |
----------------------------------------------------------------------------------------------------------
[IMUL]		 001		Recebe um valor constante e multiplica pelo acumulador						     |
----------------------------------------------------------------------------------------------------------
[LOAD]		 010		Carrega um valor constante na memória 											 |
----------------------------------------------------------------------------------------------------------
ADD			 100		Recebe um endereço e adiciona o valor contido no endereço ao acumulador 		 |
----------------------------------------------------------------------------------------------------------
JNZ			 110		Pula para linha específica caso seja diferente de 0 							 |
----------------------------------------------------------------------------------------------------------
LOAD		 101		Carrega o valor contido no endereço na memória									 |
----------------------------------------------------------------------------------------------------------
STORE		 111		Salva o que está no acumulador no parâmetro específicado 						 |
----------------------------------------------------------------------------------------------------------
XOR			 011		Operação é verdade (1) quando as variáveis assumirem valores diferentes entre si.|
----------------------------------------------------------------------------------------------------------
*)


